Tekla Open API Reference for Tekla Structures 2025
Bolt Properties
The Bolt type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the bolt. For more information see Bolt.BoltAttributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from ModelObject.)
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
 (Inherited from ModelObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
Top
See Also
Reference
Bolt Class
Tekla.Structures.Drawing Namespace